Учет_кабельной_продукции/src/Catalogs/ЖурналыУчетаКабельнойПродукции/ЖурналыУчетаКабельнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЖурналыУчетаКабельнойПродукции</name>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Объекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукцииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Трассировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>Изм</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНитки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОткудаПомещение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОткудаОборудование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обозначени1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОткудаКоординаты</name>
      <type>
        <types>CatalogRef.Координаты</types>
      </type>
    </attributes>
    <attributes>
      <name>КудаПомещение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КудаОборудование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обозначение2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КудаКоординаты</name>
      <type>
        <types>CatalogRef.Координаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаПроектная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаФактическая</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проверена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МаркировкаКабеля</name>
      <type>
        <types>CatalogRef.МаркиКабели</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Учет_кабельной_продукции/src/InformationRegisters/ДанныеЖурналовУчетаКП/ДанныеЖурналовУчетаКП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЖурналовУчетаКП</name>
  <resources>
    <name>Изм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерНитки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОткудаОборудование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОткудаПомещение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Обозначение1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОткудаКоординаты</name>
    <type>
      <types>CatalogRef.Координаты</types>
    </type>
  </resources>
  <resources>
    <name>КудаКоординаты</name>
    <type>
      <types>CatalogRef.Координаты</types>
    </type>
  </resources>
  <resources>
    <name>КудаПомещение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КудаОборудование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Обозначение2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаПроектная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаФактическая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусКабельнойЛинии</name>
    <type>
      <types>EnumRef.СтатусыКабельныхЛиний</types>
    </type>
  </resources>
  <resources>
    <name>МаркировкаКабеля</name>
    <type>
      <types>CatalogRef.МаркиКабели</types>
    </type>
  </resources>
  <dimensions>
    <name>ЖурналКабельнойПродукции</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КабельнаяЛиния</name>
    <type>
      <types>CatalogRef.КабельныеЛинии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_кабельной_продукции/src/Enums/СтатусыКабельныхЛиний/СтатусыКабельныхЛиний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКабельныхЛиний</name>
  <enumValues>
    <name>ЗаданиеНаЗакупкуНеВыдано</name>
  </enumValues>
  <enumValues>
    <name>ЗаданиеНаЗакупкуКППВОформлении</name>
  </enumValues>
  <enumValues>
    <name>ВЗакупке</name>
  </enumValues>
  <enumValues>
    <name>ВходнойКонтрольНеПройден</name>
  </enumValues>
  <enumValues>
    <name>ЭМРКППНеРазрешён</name>
  </enumValues>
  <enumValues>
    <name>ЗаданиеНаЭМРКППВОформлении</name>
  </enumValues>
  <enumValues>
    <name>ЭМРКПП</name>
  </enumValues>
  <enumValues>
    <name>ПредъявлениеЭМРКПП</name>
  </enumValues>
  <enumValues>
    <name>ЗамечанияКЭМРКПП</name>
  </enumValues>
  <enumValues>
    <name>ПодписаниеИКЖЧистовик</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>Аннулировано</name>
  </enumValues>
  <enumValues>
    <name>Заменён</name>
  </enumValues>
</mdclass:Enum>

Учет_кабельной_продукции/src/Catalogs/ЖурналыУчетаКабельнойПродукции/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;			
		
	//УдаляемыеКабельныеЛинии = НайтиУдаляемыеКабельныеЛинии();
	
	//ОчиститьЖурналКабельныхЛиний(УдаляемыеКабельныеЛинии);
	
	ЭтоНовыйЖурнал = Ссылка.Пустая();
	Если ЭтоНовыйЖурнал Тогда
		Наименование = Проект.Наименование;	
		ДополнительныеСвойства.Вставить("ЭтоНовый");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;			
	
	Если ПометкаУдаления Тогда      
		
		ПроведениеСервер.УдалитьДанныеВРСДанныеЖКП(КабельныеЛинии, Ссылка);
	ИначеЕсли ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда      
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЗаданиеНаЗакупкуНеВыдано;
		ПроведениеСервер.ЗаписьДанныеВРСДанныеЖКП(КабельныеЛинии, Ссылка, СтатусКабельнойЛинии);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура УстановитьВладелецКабельнымЛиниям()

	Для Каждого ТекКабельнаяЛиния Из КабельныеЛинии Цикл
		ОбъектЛиния = ТекКабельнаяЛиния.КабельнаяЛиния.ПолучитьОбъект();
		ОбъектЛиния.Владелец = Ссылка;
		ОбъектЛиния.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиУдаляемыеКабельныеЛинии()

	КабельныеЛинииДоУдаления    = Ссылка.КабельныеЛинии;
	КабельныеЛинииПослеУдаления = КабельныеЛинии;
	
	МассивДоУдаления    = КабельныеЛинииДоУдаления.ВыгрузитьКолонку("КабельнаяЛиния");
	МассивПослеУдаления = КабельныеЛинииПослеУдаления.ВыгрузитьКолонку("КабельнаяЛиния");
		
	УдаляемыеКабельныеЛинии = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивДоУдаления, МассивПослеУдаления);

	Возврат УдаляемыеКабельныеЛинии;
	
КонецФункции

Процедура ОчиститьЖурналКабельныхЛиний(МассивКабельныхЛиний)

	Для Каждого ТекКабЛиния Из МассивКабельныхЛиний Цикл		
		ОбъектКабельнаяЛиния          = ТекКабЛиния.ПолучитьОбъект();		
		ОбъектКабельнаяЛиния.Владелец = Справочники.ЖурналыУчетаКабельнойПродукции.ПустаяСсылка();	
		ОбъектКабельнаяЛиния.ОбменДанными.Загрузка = Истина;	
		ОбъектКабельнаяЛиния.Записать();
	КонецЦикла;		
	
КонецПроцедуры

Процедура ЗаписьДанныеВРСДанныеЖКП()  
	
	УдалитьДанныеВРСДанныеЖКП();
	
	Для Каждого ТекДанные Из КабельныеЛинии Цикл  
		МенеджерЗаписи = РегистрыСведений.ДанныеЖурналовУчетаКП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекДанные);
		МенеджерЗаписи.ЖурналКабельнойПродукции = Ссылка;   
		Если ДополнительныеСвойства.Свойство("СтатусКабельнойЛинии") Тогда   
			МенеджерЗаписи.СтатусКабельнойЛинии = ДополнительныеСвойства.СтатусКабельнойЛинии;
		КонецЕсли;	
		МенеджерЗаписи.Записать();
	КонецЦикла;	
	
КонецПроцедуры	

Процедура УдалитьДанныеВРСДанныеЖКП()  
	
	Для Каждого УдаляемыйКабель Из КабельныеЛинии Цикл   
		МенеджерЗаписи = РегистрыСведений.ДанныеЖурналовУчетаКП.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.КабельнаяЛиния           = УдаляемыйКабель.КабельнаяЛиния; 
		МенеджерЗаписи.ЖурналКабельнойПродукции = Ссылка;
		МенеджерЗаписи.Удалить();	
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
